
LECTURES = {
    "Энтропия": [
        "Введение, Энтропия (Немного о степени неопределенности, Энтропия Шеннона и проверка ожидаемых свойств)",
        "Условная энтропия (Наводящие соображения, определение условной энтропии, пример на вычисление условной энтропии, энтропия и прирост информации, вычисление прироста информации на конкретном примере)",
        "Деревья принятия решений (немного о самих деревьях, алгоритм построения дерева и пример с кошками, бинарное дерево решений, типы признаков и их группировка)",
        "Неопределенность Джинни (Определения и свойства, небольшое сравнение прироста Джинни и энтропии, прирост Джинни на данных)",
        "Деревья принятия решений на реальном примере"
    ],
    "Ансамбли моделей": [
        "Наводящие размышления, Повторные выборки(Ресемплинг) до Бутстрэпа (Джекнайф)",
        "Ресемплинг от Бутстрэп (сам Бутстрэп)",
        "Ансамбли моделей до адаптивного бустинга (Общее понятие ансамбля, Бэггинг)",
        "Ансамбли моделей от адаптивного бустинга (adaboost, стекинг, случайный лес)",
        "Многоклассовая классификация (один против все, все против всех)"
    ],
    "Обучение с подкреплением": [
        "Понятие обучения до эпсилон-жадной стратегии( Базовые определения и постановка задачи, компромисс изучение-применение, постановка задачи о k-руком бандите, жадная стратегия)",
        "Понятие обучения от эпсилон-жадной стратегии (эпсилон-жадная стратегия, softmax-стратегия, метод UCB, оптимистичные начальные оценки)",
        "Общая постановка задачи до оценки стратегий (Взаимосвязь агента и окружающей среды, функции ценности действий и состояний, пример)",
        "Общая постановка задачи (Оценка стратегий, Оптимальные стратегии)",
        "Общая постановка задачи (SARSA, Q-обучение, пример, резюме)"
    ],
}